---
type: DirectContext3DHandleSettings
namespace: Autodesk.Revit.DB.DirectContext3D
version: 2024
members: 9
tags: [revit-api, class]
---

# DirectContext3DHandleSettings

`Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | DirectContext3DHandleSettings | — | `` |
| Constructor | DirectContext3DHandleSettings | 2018 | `public DirectContext3DHandleSettings ()` |
| Method | Assign | 2018 | `public void Assign ( DirectContext3DHandleSettings other )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetTransparency | 2018 | `public int GetTransparency ()` |
| Method | IsEqual | 2018 | `public bool IsEqual ( DirectContext3DHandleSettings other )` |
| Method | SetTransparency | 2018 | `public void SetTransparency ( int transparency )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Visibility | 2018 | `public bool Visibility { get ; set ; }` |